Feature: Авторизация пользователя на Sauce Demo

  As: Авторизованный пользователь
  I want: Войти в систему с валидными данными
  So that: Я могу получить доступ к каталогу товаров

  Scenario: Успешная авторизация с валидными данными
    Given: Я нахожусь на странице логина "https://www.saucedemo.com/"
    When: Я ввожу логин "standard_user"
    And: Я ввожу пароль "secret_sauce"
    And: Я нажимаю кнопку "Login"
    Then: Я должен увидеть страницу "Products"
    And: Я должен увидеть заголовок "Products"
